nova_scheduler.org
#+TITLE: Nova Scheduler
#+DATE: 2018-04-26
#+AUTHOR: Andrey Volkov
#+EMAIL: avolkov@mirantis.com
#+OPTIONS: ^:nil
#+OPTIONS: f:t
#+OPTIONS: \n:t

* Nova Scheduler

** Intro

This doc contains 3 parts describing the following:

- common Nova scheduler principles related to scheduler setup, scheduler logic of picking a host and
  params affecting the scheduling process;
- information about Mirantis analyzer tool for Nova scheduling;
- log of booting VMs on Mirantis test lab.

** Nova Scheduler

*** Scheduler Setup

Nova scheduling process is configurable. First of all, you can choose what driver for scheduling is
used in *CONF/scheduler/driver* [fn:1]. Several options are available e.g. filter_scheduler,
caching_scheduler or chance_scheduler. As the filter_scheduler is used by default, in this doc the
most attention is focused on it. Next important setting is *CONF/scheduler/host_manager* [fn:2]
that represents the in-memory picture of the hosts and their properties that scheduler takes into
account.

For the filter_scheduler important settings are *CONF/filter_scheduler/available_filters* which are
links to python objects loaded into memory and could be used in
*CONF/filter_scheduler/enabled_filters* that are *really* used for filtering.

*CONF/filter_scheduler/weight_classes* is a list of python objects using for weighing hosts.

In MCP the filter_scheduler is used with Nova default host manager. The following filters are
enabled:

- DifferentHostFilter
- SameHostFilter
- RetryFilter
- AvailabilityZoneFilter
- RamFilter
- CoreFilter
- DiskFilter
- ComputeFilter
- ComputeCapabilitiesFilter
- ImagePropertiesFilter
- ServerGroupAntiAffinityFilter
- ServerGroupAffinityFilter
- PciPassthroughFilter
- NUMATopologyFilter
- AggregateInstanceExtraSpecsFilter

A good description could be found in filter scheduler Nova docs [fn:3].

*** Scheduler logic

The filter scheduler has several phases:

1. Get all available compute nodes. Depending on Nova release it either
   could be a request from DB or the Placement service. In Ocata, Placement is in reporting mode
   only it means data are sent to Placement but not used for scheduling. In Pike+ release Placement
   is a part of scheduling to get hosts and put allocations.
2. Filter gotten hosts. The list of hosts go through each filter in the
   order specified in *CONF/filter_scheduler/enabled_filters*. For each host a filter returns either
   true or false.
3. Weigh hosts and sort host according to weights in a descending order.
   In Ocata, the following list of weighers is used:

   - DiskWeigher
   - IoOpsWeigher
   - MetricsWeigher
   - RAMWeigher
   - ServerGroupSoftAffinityWeigher
   - ServerGroupSoftAntiAffinityWeigher

   Each weigher calculates weight for a list of host. After that those calculated normalized basing on
   min and max values. Final weight for host is calculated as sum of weights * weight_multiplier.
   weight_multiplier is specified in CONF. Default multipliers are the following:

   - ram_weight_multiplier
   - disk_weight_multiplier
   - io_ops_weight_multiplier
   - soft_affinity_weight_multiplier
   - soft_anti_affinity_weight_multiplier

   A negative value means the logic is reversed, e.g. the more io_ops on a host
   the lower host is on the sorted list.

4. Cut the weighed host list according to the *CONF/filter_scheduler/host_subset_size*
   the default is 1.

5. Pick a random host from weighed host subset.

Let's see some simple cases.

1. Equal hosts scheduling.
   We have several equal hosts, let's assume that filters pass all hosts, in that
   case only weighers affect scheduling. On the first request, a host is picked
   depending on the order in the DB, probably the order of creation.
   On the next requests, the most un-occupied hosts are picked.

2. Big+small hosts scheduling.
   In that case, most powerful hosts are used until their remaining resources
   will be less or equal to the other less powerful hosts.

3. Lay aside scheduling for hosts with big disks.
   In that case, we need to set disk_weight_multiplier to a negative value.
   For example, we have hosts with 4Tb disks (big) and 512Gb disks (small).
   Setting disk_weight_multiplier to -10 allows to schedule on a host with small
   disks first. This assumes that other host params besides the disk space
   are equal.

