nova_scheduler.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-26 Thu 17:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nova Scheduler</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrey Volkov" />
</head>
<body>
<div id="content">
<h1 class="title">Nova Scheduler</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org70d1e55">1. Nova Scheduler</a>
<ul>
<li><a href="#orgb326f58">1.1. Intro</a></li>
<li><a href="#orgfd6f9bc">1.2. Nova Scheduler</a>
<ul>
<li><a href="#org811b1c7">1.2.1. Scheduler Setup</a></li>
<li><a href="#org4be7cea">1.2.2. Scheduler logic</a></li>
<li><a href="#org6ec5324">1.2.3. Params affecting scheduling</a></li>
</ul>
</li>
<li><a href="#orgb38547b">1.3. Debug scheduling</a></li>
<li><a href="#org48b80a1">1.4. Test on Mirantis lab</a>
<ul>
<li><a href="#org03417f9">1.4.1. Env description</a></li>
<li><a href="#orgb4b25e9">1.4.2. Apply the patch for the scheduler</a></li>
<li><a href="#orgab8c16e">1.4.3. Boot VMs</a></li>
<li><a href="#orge8b5d85">1.4.4. Check VM distribution</a></li>
<li><a href="#org6d336a1">1.4.5. Analysis of what happened</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org70d1e55" class="outline-2">
<h2 id="org70d1e55"><span class="section-number-2">1</span> Nova Scheduler</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb326f58" class="outline-3">
<h3 id="orgb326f58"><span class="section-number-3">1.1</span> Intro</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This doc contains 3 parts describing the following:<br />
</p>

<ul class="org-ul">
<li>common Nova scheduler principles related to scheduler setup, scheduler logic of picking a host and<br />
params affecting the scheduling process;<br /></li>
<li>information about Mirantis analyzer tool for Nova scheduling;<br /></li>
<li>log of booting VMs on Mirantis test lab.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd6f9bc" class="outline-3">
<h3 id="orgfd6f9bc"><span class="section-number-3">1.2</span> Nova Scheduler</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org811b1c7" class="outline-4">
<h4 id="org811b1c7"><span class="section-number-4">1.2.1</span> Scheduler Setup</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Nova scheduling process is configurable. First of all, you can choose what driver for scheduling is<br />
used in <b>CONF/scheduler/driver</b> <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Several options are available e.g. filter_scheduler,<br />
caching_scheduler or chance_scheduler. As the filter_scheduler is used by default, in this doc the<br />
most attention is focused on it. Next important setting is <b>CONF/scheduler/host_manager</b> <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup><br />
that represents the in-memory picture of the hosts and their properties that scheduler takes into<br />
account.<br />
</p>

<p>
For the filter_scheduler important settings are <b>CONF/filter_scheduler/available_filters</b> which are<br />
links to python objects loaded into memory and could be used in<br />
<b>CONF/filter_scheduler/enabled_filters</b> that are <b>really</b> used for filtering.<br />
</p>

<p>
<b>CONF/filter_scheduler/weight_classes</b> is a list of python objects using for weighing hosts.<br />
</p>

<p>
In MCP the filter_scheduler is used with Nova default host manager. The following filters are<br />
enabled:<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">DifferentHostFilter</td>
</tr>

<tr>
<td class="org-left">SameHostFilter</td>
</tr>

<tr>
<td class="org-left">RetryFilter</td>
</tr>

<tr>
<td class="org-left">AvailabilityZoneFilter</td>
</tr>

<tr>
<td class="org-left">RamFilter</td>
</tr>

<tr>
<td class="org-left">CoreFilter</td>
</tr>

<tr>
<td class="org-left">DiskFilter</td>
</tr>

<tr>
<td class="org-left">ComputeFilter</td>
</tr>

<tr>
<td class="org-left">ComputeCapabilitiesFilter</td>
</tr>

<tr>
<td class="org-left">ImagePropertiesFilter</td>
</tr>

<tr>
<td class="org-left">ServerGroupAntiAffinityFilter</td>
</tr>

<tr>
<td class="org-left">ServerGroupAffinityFilter</td>
</tr>

<tr>
<td class="org-left">PciPassthroughFilter</td>
</tr>

<tr>
<td class="org-left">NUMATopologyFilter</td>
</tr>

<tr>
<td class="org-left">AggregateInstanceExtraSpecsFilter</td>
</tr>
</tbody>
</table>

<p>
A good description could be found in filter scheduler Nova docs <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.<br />
</p>
</div>
</div>

<div id="outline-container-org4be7cea" class="outline-4">
<h4 id="org4be7cea"><span class="section-number-4">1.2.2</span> Scheduler logic</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
The filter scheduler has several phases:<br />
</p>

<ol class="org-ol">
<li>Get all available compute nodes. Depending on Nova release it either<br />
could be a request from DB or the Placement service. In Ocata, Placement is in reporting mode<br />
only it means data are sent to Placement but not used for scheduling. In Pike+ release Placement<br />
is a part of scheduling to get hosts and put allocations.<br /></li>
<li>Filter gotten hosts. The list of hosts go through each filter in the<br />
order specified in <b>CONF/filter_scheduler/enabled_filters</b>. For each host a filter returns either<br />
true or false.<br /></li>
<li><p>
Weigh hosts and sort host according to weights in a descending order.<br />
In Ocata, the following list of weighers is used:<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">DiskWeigher</td>
</tr>

<tr>
<td class="org-left">IoOpsWeigher</td>
</tr>

<tr>
<td class="org-left">MetricsWeigher</td>
</tr>

<tr>
<td class="org-left">RAMWeigher</td>
</tr>

<tr>
<td class="org-left">ServerGroupSoftAffinityWeigher</td>
</tr>

<tr>
<td class="org-left">ServerGroupSoftAntiAffinityWeigher</td>
</tr>
</tbody>
</table>

<p>
Each weigher calculates weight for a list of host. After that those calculated normalized basing on<br />
min and max values. Final weight for host is calculated as sum of weights * weight_multiplier.<br />
weight_multiplier is specified in CONF. Default multipliers are the following:<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ram_weight_multiplier</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">disk_weight_multiplier</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">io_ops_weight_multiplier</td>
<td class="org-right">-1.0</td>
</tr>

<tr>
<td class="org-left">soft_affinity_weight_multiplier</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">soft_anti_affinity_weight_multiplier</td>
<td class="org-right">1.0</td>
</tr>
</tbody>
</table>

<p>
A negative value means the logic is reversed, e.g. the more io_ops on a host<br />
the lower host is on the sorted list.<br />
</p></li>

<li>Cut the weighed host list according to the <b>CONF/filter_scheduler/host_subset_size</b><br />
the default is 1.<br /></li>

<li>Pick a random host from weighed host subset.<br /></li>
</ol>

<p>
Let's see some simple cases.<br />
</p>

<ol class="org-ol">
<li>Equal hosts scheduling.<br />
We have several equal hosts, let's assume that filters pass all hosts, in that<br />
case only weighers affect scheduling. On the first request, a host is picked<br />
depending on the order in the DB, probably the order of creation.<br />
On the next requests, the most un-occupied hosts are picked.<br /></li>

<li>Big+small hosts scheduling.<br />
In that case, most powerful hosts are used until their remaining resources<br />
will be less or equal to the other less powerful hosts.<br /></li>

<li>Lay aside scheduling for hosts with big disks.<br />
In that case, we need to set disk_weight_multiplier to a negative value.<br />
For example, we have hosts with 4Tb disks (big) and 512Gb disks (small).<br />
Setting disk_weight_multiplier to -10 allows to schedule on a host with small<br />
disks first. This assumes that other host params besides the disk space<br />
are equal.<br /></li>
</ol>
</div>
</div>
