nova_scheduler.org
*** Params affecting scheduling

The ways affect scheduling is mostly coded in filters.
The following params could affect scheduling:

- availability_zone - a param for create server request [fn:4], it restricts the list of
  hosts can be used to the hosts with particular availability_zone;
- scheduler_hints - params for the create server request

  - build_near_host_ip
  - cidr
  - different_cell
  - different_host
  - group
  - query
  - same_host
  - target_cell

- flavor extra_specs

  - pci_passthrough:alias
  - hw:cpu_policy
  - hw:cpu_thread_policy
  - aggregate_instance_extra_specs
  - capabilities:*

- image properties

  - hw:cpu_policy
  - hw:cpu_thread_policy
  - hw_architecture
  - img_hv_type
  - hw_vm_mode
  - img_hv_requested_version

- Placement allocation candidate request options.
  Since Pike+ it is possible to specify params for the Placement request with
  flavor extra specs:

  - resources:$RESOURCE_CLASS:
  - resources$N:$RESOURCE_CLASS:
  - trait:$TRAIT_NAME:
  - trait$N:$TRAIT_NAME:

** Debug scheduling

As there many factors affecting the scheduling process sometimes it
needs to go deeper to understand what happens. The questions
wanted to be answered could be:
- How many hosts were gotten by the scheduler? What are they?
- How many hosts were passed/rejected by each filter? What are they?
- What weight the host have? What value was gotten from the particular weigher?
- What host was chosen and where VM is actually placed?

For that purpose, Mirantis implemented a patch that logs all required data
in JSON-format into a file specified by *CONF/filter_scheduler/scheduler_debug_file*.

After booting a VM, scheduler_debug_file could be uploaded into DB
and analyzed with arbitrary SQL-queries.

** Test on Mirantis lab

