nova_scheduler.html

<div id="outline-container-org6ec5324" class="outline-4">
<h4 id="org6ec5324"><span class="section-number-4">1.2.3</span> Params affecting scheduling</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
The ways affect scheduling is mostly coded in filters.<br />
The following params could affect scheduling:<br />
</p>

<ul class="org-ul">
<li>availability_zone - a param for create server request <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>, it restricts the list of<br />
hosts can be used to the hosts with particular availability_zone;<br /></li>
<li><p>
scheduler_hints - params for the create server request<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">build_near_host_ip</td>
</tr>

<tr>
<td class="org-left">cidr</td>
</tr>

<tr>
<td class="org-left">different_cell</td>
</tr>

<tr>
<td class="org-left">different_host</td>
</tr>

<tr>
<td class="org-left">group</td>
</tr>

<tr>
<td class="org-left">query</td>
</tr>

<tr>
<td class="org-left">same_host</td>
</tr>

<tr>
<td class="org-left">target_cell</td>
</tr>
</tbody>
</table></li>

<li><p>
flavor extra_specs<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">pci_passthrough:alias</td>
</tr>

<tr>
<td class="org-left">hw:cpu_policy</td>
</tr>

<tr>
<td class="org-left">hw:cpu_thread_policy</td>
</tr>

<tr>
<td class="org-left">aggregate_instance_extra_specs</td>
</tr>

<tr>
<td class="org-left">capabilities:*</td>
</tr>
</tbody>
</table></li>

<li><p>
image properties<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">hw:cpu_policy</td>
</tr>

<tr>
<td class="org-left">hw:cpu_thread_policy</td>
</tr>

<tr>
<td class="org-left">hw_architecture</td>
</tr>

<tr>
<td class="org-left">img_hv_type</td>
</tr>

<tr>
<td class="org-left">hw_vm_mode</td>
</tr>

<tr>
<td class="org-left">img_hv_requested_version</td>
</tr>
</tbody>
</table></li>

<li><p>
Placement allocation candidate request options.<br />
Since Pike+ it is possible to specify params for the Placement request with<br />
flavor extra specs:<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">resources:$RESOURCE_CLASS: $AMOUNT</td>
</tr>

<tr>
<td class="org-left">resources$N:$RESOURCE_CLASS: $AMOUNT</td>
</tr>

<tr>
<td class="org-left">trait:$TRAIT_NAME: required</td>
</tr>

<tr>
<td class="org-left">trait$N:$TRAIT_NAME: required</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb38547b" class="outline-3">
<h3 id="orgb38547b"><span class="section-number-3">1.3</span> Debug scheduling</h3>
<div class="outline-text-3" id="text-1-3">
<p>
As there many factors affecting the scheduling process sometimes it<br />
needs to go deeper to understand what happens. The questions<br />
wanted to be answered could be:<br />
</p>
<ul class="org-ul">
<li>How many hosts were gotten by the scheduler? What are they?<br /></li>
<li>How many hosts were passed/rejected by each filter? What are they?<br /></li>
<li>What weight the host have? What value was gotten from the particular weigher?<br /></li>
<li>What host was chosen and where VM is actually placed?<br /></li>
</ul>

<p>
For that purpose, Mirantis implemented a patch that logs all required data<br />
in JSON-format into a file specified by <b>CONF/filter_scheduler/scheduler_debug_file</b>.<br />
</p>

<p>
After booting a VM, scheduler_debug_file could be uploaded into DB<br />
and analyzed with arbitrary SQL-queries.<br />
</p>
</div>
</div>

<div id="outline-container-org48b80a1" class="outline-3">
<h3 id="org48b80a1"><span class="section-number-3">1.4</span> Test on Mirantis lab</h3>
<div class="outline-text-3" id="text-1-4">
</div>
