nova_scheduler.org
*** Env description

There is an env with 20 compute nodes.

#+BEGIN_SRC shell :session shell-o20-ctl01 :results raw replace
openstack hypervisor list
#+END_SRC

+----+-------------------------------------------------------+-----------------+---------------+-------+
| ID | Hypervisor Hostname                                   | Hypervisor Type | Host IP       | State |
+----+-------------------------------------------------------+-----------------+---------------+-------+
|  1 | cmp13.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.96  | up    |
|  4 | cmp17.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.112 | up    |
|  7 | cmp12.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.108 | up    |
| 10 | cmp15.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.99  | up    |
| 13 | cmp1.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.107 | up    |
| 16 | cmp2.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.113 | up    |
| 19 | cmp16.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.106 | up    |
| 22 | cmp6.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.103 | up    |
| 25 | cmp10.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.109 | up    |
| 28 | cmp4.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.111 | up    |
| 31 | cmp0.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.104 | up    |
| 34 | cmp9.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.110 | up    |
| 37 | cmp14.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.105 | up    |
| 40 | cmp18.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.101 | up    |
| 43 | cmp19.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.114 | up    |
| 46 | cmp3.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.102 | up    |
| 49 | cmp8.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.100 | up    |
| 52 | cmp5.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.97  | up    |
| 55 | cmp11.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local | QEMU            | 172.16.10.98  | up    |
| 58 | cmp7.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  | QEMU            | 172.16.10.95  | up    |
+----+-------------------------------------------------------+-----------------+---------------+-------+

Set scheduler_subset_size to 1.

#+BEGIN_SRC sh :session shell-o20-cfg :results silent
salt ctl* pkg.install crudini --no-color
salt ctl* cmd.run 'crudini --set /etc/nova/nova.conf filter_scheduler host_subset_size 1' --no-color
salt ctl* cmd.run 'systemctl restart nova-scheduler' --no-color
#+END_SRC

*** Apply the patch for the scheduler

Patch scheduler to log inner state.

#+BEGIN_SRC sh :session shell-default :results silent
cd ~/m/nova
git co mcp/ocata
git format-patch -1 HEAD
scp 0001-Add-debug-logging-for-scheduler.patch o20-cfg:/tmp/
#+END_SRC

#+BEGIN_SRC sh :session shell-o20-cfg :results silent
salt-cp ctl* /tmp/0001-Add-debug-logging-for-scheduler.patch /tmp/0001-Add-debug-logging-for-scheduler.patch
salt ctl* cmd.run 'cd /usr/lib/python2.7/dist-packages/; patch -p1 --backup < /tmp/0001-Add-debug-logging-for-scheduler.patch'
salt ctl* cmd.run 'systemctl restart nova-scheduler' --no-color
salt ctl* cmd.run 'rm /tmp/scheduling' --no-color
#+END_SRC

*** Boot VMs

#+BEGIN_SRC shell :session shell-o20-ctl01 :results silent
openstack server list -c ID -f value | xargs openstack server delete
flavor=f1; img=8466bbdb-7bd3-4528-a3a3-a3b1c9ecbb32; for i in {1..20}; do nova boot --flavor $flavor --image $img vm-$i; sleep 10; done
#+END_SRC

