nova_scheduler.html
<div id="outline-container-org03417f9" class="outline-4">
<h4 id="org03417f9"><span class="section-number-4">1.4.1</span> Env description</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
There is an env with 20 compute nodes.<br />
</p>

<div class="org-src-container">
<pre class="src src-shell">openstack hypervisor list
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.0.50.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;ID&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Hypervisor&nbsp;Hostname&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Hypervisor&nbsp;Type&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Host&nbsp;IP&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;State&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;1&nbsp;<br />
      &nbsp;&nbsp;4&nbsp;<br />
      &nbsp;&nbsp;7&nbsp;<br />
      &nbsp;10&nbsp;<br />
      &nbsp;13&nbsp;<br />
      &nbsp;16&nbsp;<br />
      &nbsp;19&nbsp;<br />
      &nbsp;22&nbsp;<br />
      &nbsp;25&nbsp;<br />
      &nbsp;28&nbsp;<br />
      &nbsp;31&nbsp;<br />
      &nbsp;34&nbsp;<br />
      &nbsp;37&nbsp;<br />
      &nbsp;40&nbsp;<br />
      &nbsp;43&nbsp;<br />
      &nbsp;46&nbsp;<br />
      &nbsp;49&nbsp;<br />
      &nbsp;52&nbsp;<br />
      &nbsp;55&nbsp;<br />
      &nbsp;58&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;cmp13.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp17.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp12.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp15.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp1.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp2.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp16.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp6.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp10.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp4.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp0.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp9.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp14.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp18.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp19.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp3.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp8.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp5.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;<br />
      &nbsp;cmp11.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;<br />
      &nbsp;cmp7.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;QEMU&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;172.16.10.96&nbsp;&nbsp;<br />
      &nbsp;172.16.10.112&nbsp;<br />
      &nbsp;172.16.10.108&nbsp;<br />
      &nbsp;172.16.10.99&nbsp;&nbsp;<br />
      &nbsp;172.16.10.107&nbsp;<br />
      &nbsp;172.16.10.113&nbsp;<br />
      &nbsp;172.16.10.106&nbsp;<br />
      &nbsp;172.16.10.103&nbsp;<br />
      &nbsp;172.16.10.109&nbsp;<br />
      &nbsp;172.16.10.111&nbsp;<br />
      &nbsp;172.16.10.104&nbsp;<br />
      &nbsp;172.16.10.110&nbsp;<br />
      &nbsp;172.16.10.105&nbsp;<br />
      &nbsp;172.16.10.101&nbsp;<br />
      &nbsp;172.16.10.114&nbsp;<br />
      &nbsp;172.16.10.102&nbsp;<br />
      &nbsp;172.16.10.100&nbsp;<br />
      &nbsp;172.16.10.97&nbsp;&nbsp;<br />
      &nbsp;172.16.10.98&nbsp;&nbsp;<br />
      &nbsp;172.16.10.95&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;up&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
Set scheduler_subset_size to 1.<br />
</p>

<div class="org-src-container">
<pre class="src src-sh">salt ctl* pkg.install crudini --no-color
salt ctl* cmd.run <span style="color: #71a19f;">'crudini --set /etc/nova/nova.conf filter_scheduler host_subset_size 1'</span> --no-color
salt ctl* cmd.run <span style="color: #71a19f;">'systemctl restart nova-scheduler'</span> --no-color
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4b25e9" class="outline-4">
<h4 id="orgb4b25e9"><span class="section-number-4">1.4.2</span> Apply the patch for the scheduler</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Patch scheduler to log inner state.<br />
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #71a46c;">cd</span> ~/m/nova
git co mcp/ocata
git format-patch -1 HEAD
scp 0001-Add-debug-logging-for-scheduler.patch o20-cfg:/tmp/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">salt-cp ctl* /tmp/0001-Add-debug-logging-for-scheduler.patch /tmp/0001-Add-debug-logging-for-scheduler.patch
salt ctl* cmd.run <span style="color: #71a19f;">'cd /usr/lib/python2.7/dist-packages/; patch -p1 --backup &lt; /tmp/0001-Add-debug-logging-for-scheduler.patch'</span>
salt ctl* cmd.run <span style="color: #71a19f;">'systemctl restart nova-scheduler'</span> --no-color
salt ctl* cmd.run <span style="color: #71a19f;">'rm /tmp/scheduling'</span> --no-color
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab8c16e" class="outline-4">
<h4 id="orgab8c16e"><span class="section-number-4">1.4.3</span> Boot VMs</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-shell">openstack server list -c ID -f value | xargs openstack server delete
<span style="color: #c27d7b;">flavor</span>=f1; <span style="color: #c27d7b;">img</span>=8466bbdb-7bd3-4528-a3a3-a3b1c9ecbb32; <span style="color: #96905f; font-weight: bold;">for</span> i<span style="color: #96905f; font-weight: bold;"> in</span> {1..20}; <span style="color: #96905f; font-weight: bold;">do</span> nova boot --flavor $<span style="color: #c27d7b;">flavor</span> --image $<span style="color: #c27d7b;">img</span> vm-$<span style="color: #c27d7b;">i</span>; sleep 10; <span style="color: #96905f; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
