nova_scheduler.org
*** Check VM distribution

#+BEGIN_SRC sh :session shell-o20-ctl01 :results raw
openstack server list -c Name -f value | wc -l
openstack server list --long -c Host -f value | sort | uniq -c
#+END_SRC

| 20 |

| 1 cmp0  |
| 1 cmp1  |
| 1 cmp10 |
| 1 cmp11 |
| 1 cmp12 |
| 1 cmp13 |
| 1 cmp14 |
| 1 cmp15 |
| 1 cmp16 |
| 1 cmp17 |
| 1 cmp18 |
| 1 cmp19 |
| 1 cmp2  |
| 1 cmp3  |
| 1 cmp4  |
| 1 cmp5  |
| 1 cmp6  |
| 1 cmp7  |
| 1 cmp8  |
| 1 cmp9  |

The same should be in the Placement service.

#+BEGIN_SRC sh :session shell-o20-mysql
select p.name, count(*) from allocations a join resource_providers p on a.resource_provider_id = p.id where resource_class_id = 0 group by 1;
#+END_SRC

#+begin_example
+-------------------------------------------------------+----------+
| name                                                  | count(*) |
+-------------------------------------------------------+----------+
| cmp0.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp1.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp10.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp11.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp12.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp13.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp14.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp15.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp16.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp17.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp18.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp19.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp2.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp3.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp4.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp5.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp6.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp7.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp8.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp9.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
+-------------------------------------------------------+----------+
20 rows in set (0.00 sec)
#+end_example

