nova_scheduler.html

<div id="outline-container-orge8b5d85" class="outline-4">
<h4 id="orge8b5d85"><span class="section-number-4">1.4.4</span> Check VM distribution</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">
<pre class="src src-sh">openstack server list -c Name -f value | wc -l
openstack server list --long -c Host -f value | sort | uniq -c
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">20</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">1 cmp0</td>
</tr>

<tr>
<td class="org-left">1 cmp1</td>
</tr>

<tr>
<td class="org-left">1 cmp10</td>
</tr>

<tr>
<td class="org-left">1 cmp11</td>
</tr>

<tr>
<td class="org-left">1 cmp12</td>
</tr>

<tr>
<td class="org-left">1 cmp13</td>
</tr>

<tr>
<td class="org-left">1 cmp14</td>
</tr>

<tr>
<td class="org-left">1 cmp15</td>
</tr>

<tr>
<td class="org-left">1 cmp16</td>
</tr>

<tr>
<td class="org-left">1 cmp17</td>
</tr>

<tr>
<td class="org-left">1 cmp18</td>
</tr>

<tr>
<td class="org-left">1 cmp19</td>
</tr>

<tr>
<td class="org-left">1 cmp2</td>
</tr>

<tr>
<td class="org-left">1 cmp3</td>
</tr>

<tr>
<td class="org-left">1 cmp4</td>
</tr>

<tr>
<td class="org-left">1 cmp5</td>
</tr>

<tr>
<td class="org-left">1 cmp6</td>
</tr>

<tr>
<td class="org-left">1 cmp7</td>
</tr>

<tr>
<td class="org-left">1 cmp8</td>
</tr>

<tr>
<td class="org-left">1 cmp9</td>
</tr>
</tbody>
</table>

<p>
The same should be in the Placement service.<br />
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #96905f; font-weight: bold;">select</span> p.name, count(*) from allocations a join resource_providers p on a.resource_provider_id = p.id where resource_class_id = 0 group by 1;
</pre>
</div>

<pre class="example">
+-------------------------------------------------------+----------+
| name                                                  | count(*) |
+-------------------------------------------------------+----------+
| cmp0.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp1.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp10.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp11.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp12.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp13.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp14.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp15.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp16.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp17.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp18.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp19.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local |        1 |
| cmp2.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp3.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp4.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp5.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp6.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp7.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp8.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
| cmp9.vsaienko-deploy-heat-os-ha-ovs-440.bud-mk.local  |        1 |
+-------------------------------------------------------+----------+
20 rows in set (0.00 sec)
</pre>
</div>
</div>
