nova_scheduler.org
*** Analysis of what happened

#+BEGIN_SRC sh :session shell-o20-cfg :results silent
salt 'ctl*' cp.get_file_str /tmp/scheduling | grep '{' > /tmp/scheduling
#+END_SRC

#+BEGIN_SRC sh :session shell-default :results silent
scp o20-cfg:/tmp/scheduling /tmp/scheduling
cd /tmp
rm /tmp/scheduling.sqlite
create_db_from_json.py scheduling
#+END_SRC

See the number of requests and created time.

#+BEGIN_SRC sqlite :db /tmp/scheduling.sqlite :results replace
select server, req, host, created from scheduling where step = 'random' order by created;
#+END_SRC

#+RESULTS:
| ctl02 | req-87cfd45a-d75f-497e-852d-902c009df4e4 | cmp15 | 2018-04-25T11:41:54.004968 |
| ctl03 | req-3cc00bce-a93f-4f0c-b80d-066fe53abe5b | cmp5  | 2018-04-25T11:42:07.019612 |
| ctl01 | req-653de11c-26bd-46ec-98e8-3f95b5c5ddc2 | cmp4  | 2018-04-25T11:42:19.890834 |
| ctl02 | req-8128f5a2-765d-40df-9f61-01fcd1c01e80 | cmp19 | 2018-04-25T11:42:32.582589 |
| ctl03 | req-23395836-daaa-434c-ad6a-45df8f7df83b | cmp3  | 2018-04-25T11:42:45.212269 |
| ctl01 | req-7197ee44-7fff-4655-acae-07cbf6a80271 | cmp2  | 2018-04-25T11:42:57.847633 |
| ctl02 | req-c1011535-a5bc-405b-9eea-160ed6746919 | cmp8  | 2018-04-25T11:43:10.497954 |
| ctl03 | req-6a9613a6-95e2-4623-9e98-fede9d008275 | cmp11 | 2018-04-25T11:43:23.351091 |
| ctl01 | req-e45e02dd-c589-4d3f-a0d0-ef319e9ba317 | cmp9  | 2018-04-25T11:43:36.236971 |
| ctl02 | req-09f9104f-9243-4952-a012-827ac9cec1b0 | cmp12 | 2018-04-25T11:43:48.950534 |
| ctl03 | req-0ac48913-03b0-4ce3-be02-f942c3966ad4 | cmp7  | 2018-04-25T11:44:01.669161 |
| ctl01 | req-d770b31e-96a5-4d0e-bbc3-1ca4705910a2 | cmp0  | 2018-04-25T11:44:14.648089 |
| ctl02 | req-3e7b83c6-6422-4994-b79a-3ab16ad7c27a | cmp17 | 2018-04-25T11:44:27.210015 |
| ctl03 | req-166f846f-459e-45d3-a1cc-077d7804e9ea | cmp18 | 2018-04-25T11:44:39.780238 |
| ctl01 | req-7fe5cc41-9e4e-4c3d-bdab-bb6f59daae79 | cmp14 | 2018-04-25T11:44:52.529928 |
| ctl02 | req-d32e3cb2-4719-42f0-af40-a69f5261e80f | cmp1  | 2018-04-25T11:45:05.307609 |
| ctl03 | req-b90c8c9e-3d8e-41aa-b2f2-04d710f80f20 | cmp16 | 2018-04-25T11:45:17.881671 |
| ctl01 | req-060835ec-f759-46fd-bd2c-577cb44b047f | cmp10 | 2018-04-25T11:45:30.639395 |
| ctl02 | req-e9a95a17-2ff9-4a0c-9186-a93286a57148 | cmp6  | 2018-04-25T11:45:43.316294 |
| ctl03 | req-b8e73829-4871-4ab1-8a6e-a45bc14eea77 | cmp13 | 2018-04-25T11:45:56.000713 |

See numbers of hosts for each step.

#+BEGIN_SRC sqlite :db /tmp/scheduling.sqlite :results replace
select step, filter, count(*) from scheduling where req = 'req-87cfd45a-d75f-497e-852d-902c009df4e4' group by 1, 2 order by created;
#+END_SRC

| load      |                                   | 20 |
| filtering | DifferentHostFilter               | 20 |
| filtering | SameHostFilter                    | 20 |
| filtering | RetryFilter                       | 20 |
| filtering | AvailabilityZoneFilter            | 20 |
| filtering | RamFilter                         | 20 |
| filtering | CoreFilter                        | 20 |
| filtering | DiskFilter                        | 20 |
| filtering | ComputeFilter                     | 20 |
| filtering | ComputeCapabilitiesFilter         | 20 |
| filtering | ImagePropertiesFilter             | 20 |
| filtering | ServerGroupAntiAffinityFilter     | 20 |
| filtering | ServerGroupAffinityFilter         | 20 |
| filtering | PciPassthroughFilter              | 20 |
| filtering | NUMATopologyFilter                | 20 |
| filtering | AggregateInstanceExtraSpecsFilter | 20 |
| weighing  |                                   | 20 |
| subset    |                                   |  1 |
| random    |                                   |  1 |

See weights for the first request.

#+BEGIN_SRC sqlite :db /tmp/scheduling.sqlite :results replace
select host, weight, weights from scheduling where req = 'req-87cfd45a-d75f-497e-852d-902c009df4e4' and step = 'weighing' order by id;
#+END_SRC

| cmp15 |           2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp1  |           2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp5  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp2  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp8  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp11 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp19 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp4  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp9  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp3  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp12 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp7  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp0  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp17 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp18 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp14 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp16 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp10 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp6  | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp13 | 1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |

See weights for the second request.

#+BEGIN_SRC sqlite :db /tmp/scheduling.sqlite :results replace
select host, weight, weights from scheduling where req = 'req-3cc00bce-a93f-4f0c-b80d-066fe53abe5b' and step = 'weighing' order by id;
#+END_SRC

| cmp5  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp4  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp0  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp17 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp18 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp14 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp1  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp6  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp2  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp8  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp11 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp19 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp9  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp3  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp12 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp7  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp16 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp10 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp13 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp15 | 0.965734172132 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 0.9657341721322447, u'IoOpsWeigher': 0.0, u'MetricsWeigher': 0.0}                               |

#+BEGIN_SRC sqlite :db /tmp/scheduling.sqlite :results replace
select host, weight, weights from scheduling where req = 'req-653de11c-26bd-46ec-98e8-3f95b5c5ddc2' and step = 'weighing' order by id;
#+END_SRC

See weights for the third request.

| cmp4  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp3  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp0  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp17 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp18 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp14 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp1  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp16 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp10 |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp6  |            2.0 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}                                              |
| cmp2  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp8  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp11 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp19 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp9  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp12 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp7  |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp13 |  1.97222222222 | {u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0} |
| cmp5  | 0.965734172132 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 0.9657341721322447, u'IoOpsWeigher': 0.0, u'MetricsWeigher': 0.0}                               |
| cmp15 | 0.965734172132 | {u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 0.9657341721322447, u'IoOpsWeigher': 0.0, u'MetricsWeigher': 0.0}                               |

[fn:1] https://docs.openstack.org/nova/latest/configuration/config.html?highlight=host_manager#scheduler

[fn:2] https://docs.openstack.org/nova/latest/configuration/config.html?highlight=driver#scheduler

[fn:3] https://docs.openstack.org/nova/latest/user/filter-scheduler.html

[fn:4] https://developer.openstack.org/api-ref/compute/#create-server

[fn:5] https://docs.openstack.org/nova/latest/admin/configuration/schedulers.html
