nova_scheduler.html

<div id="outline-container-org6d336a1" class="outline-4">
<h4 id="org6d336a1"><span class="section-number-4">1.4.5</span> Analysis of what happened</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">
<pre class="src src-sh">salt <span style="color: #71a19f;">'ctl*'</span> cp.get_file_str /tmp/scheduling | grep <span style="color: #71a19f;">'{'</span> &gt; /tmp/scheduling
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">scp o20-cfg:/tmp/scheduling /tmp/scheduling
<span style="color: #71a46c;">cd</span> /tmp
rm /tmp/scheduling.sqlite
create_db_from_json.py scheduling
</pre>
</div>

<p>
See the number of requests and created time.<br />
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #96905f; font-weight: bold;">select</span> server, req, <span style="color: #96905f; font-weight: bold;">host</span>, created <span style="color: #96905f; font-weight: bold;">from</span> scheduling <span style="color: #96905f; font-weight: bold;">where</span> step = <span style="color: #71a19f;">'random'</span> <span style="color: #96905f; font-weight: bold;">order</span> <span style="color: #96905f; font-weight: bold;">by</span> created;
</pre>
</div>

<p>
See numbers of hosts for each step.<br />
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #96905f; font-weight: bold;">select</span> step, filter, <span style="color: #71a46c;">count</span>(*) <span style="color: #96905f; font-weight: bold;">from</span> scheduling <span style="color: #96905f; font-weight: bold;">where</span> req = <span style="color: #71a19f;">'req-87cfd45a-d75f-497e-852d-902c009df4e4'</span> <span style="color: #96905f; font-weight: bold;">group</span> <span style="color: #96905f; font-weight: bold;">by</span> 1, 2 <span style="color: #96905f; font-weight: bold;">order</span> <span style="color: #96905f; font-weight: bold;">by</span> created;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">load</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">DifferentHostFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">SameHostFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">RetryFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">AvailabilityZoneFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">RamFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">CoreFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">DiskFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">ComputeFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">ComputeCapabilitiesFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">ImagePropertiesFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">ServerGroupAntiAffinityFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">ServerGroupAffinityFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">PciPassthroughFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">NUMATopologyFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">filtering</td>
<td class="org-left">AggregateInstanceExtraSpecsFilter</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">weighing</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">subset</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">random</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
See weights for the first request.<br />
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #96905f; font-weight: bold;">select</span> <span style="color: #96905f; font-weight: bold;">host</span>, weight, weights <span style="color: #96905f; font-weight: bold;">from</span> scheduling <span style="color: #96905f; font-weight: bold;">where</span> req = <span style="color: #71a19f;">'req-87cfd45a-d75f-497e-852d-902c009df4e4'</span> <span style="color: #96905f; font-weight: bold;">and</span> step = <span style="color: #71a19f;">'weighing'</span> <span style="color: #96905f; font-weight: bold;">order</span> <span style="color: #96905f; font-weight: bold;">by</span> id;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">cmp15</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp1</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp5</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp2</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp8</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp11</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp19</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp4</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp9</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp3</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp12</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp7</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp0</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp17</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp18</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp14</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp16</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp10</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp6</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp13</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>
</tbody>
</table>

<p>
See weights for the second request.<br />
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #96905f; font-weight: bold;">select</span> <span style="color: #96905f; font-weight: bold;">host</span>, weight, weights <span style="color: #96905f; font-weight: bold;">from</span> scheduling <span style="color: #96905f; font-weight: bold;">where</span> req = <span style="color: #71a19f;">'req-3cc00bce-a93f-4f0c-b80d-066fe53abe5b'</span> <span style="color: #96905f; font-weight: bold;">and</span> step = <span style="color: #71a19f;">'weighing'</span> <span style="color: #96905f; font-weight: bold;">order</span> <span style="color: #96905f; font-weight: bold;">by</span> id;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">cmp5</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp4</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp0</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp17</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp18</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp14</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp1</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp6</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp2</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp8</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp11</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp19</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp9</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp3</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp12</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp7</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp16</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp10</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp13</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp15</td>
<td class="org-right">0.965734172132</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 0.9657341721322447, u'IoOpsWeigher': 0.0, u'MetricsWeigher': 0.0}</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #96905f; font-weight: bold;">select</span> <span style="color: #96905f; font-weight: bold;">host</span>, weight, weights <span style="color: #96905f; font-weight: bold;">from</span> scheduling <span style="color: #96905f; font-weight: bold;">where</span> req = <span style="color: #71a19f;">'req-653de11c-26bd-46ec-98e8-3f95b5c5ddc2'</span> <span style="color: #96905f; font-weight: bold;">and</span> step = <span style="color: #71a19f;">'weighing'</span> <span style="color: #96905f; font-weight: bold;">order</span> <span style="color: #96905f; font-weight: bold;">by</span> id;
</pre>
</div>

<p>
See weights for the third request.<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">cmp4</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp3</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp0</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp17</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp18</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp14</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp1</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp16</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp10</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp6</td>
<td class="org-right">2.0</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 2.0, u'IoOpsWeigher': 1.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp2</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp8</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp11</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp19</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp9</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp12</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp7</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp13</td>
<td class="org-right">1.97222222222</td>
<td class="org-left">{u'DiskWeigher': 0.9722222222222222, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 1.9722222222222223, u'IoOpsWeigher': 0.9722222222222222, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp5</td>
<td class="org-right">0.965734172132</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 0.9657341721322447, u'IoOpsWeigher': 0.0, u'MetricsWeigher': 0.0}</td>
</tr>

<tr>
<td class="org-left">cmp15</td>
<td class="org-right">0.965734172132</td>
<td class="org-left">{u'DiskWeigher': 1.0, u'ServerGroupSoftAntiAffinityWeigher': 0.0, u'ServerGroupSoftAffinityWeigher': 0.0, u'RAMWeigher': 0.9657341721322447, u'IoOpsWeigher': 0.0, u'MetricsWeigher': 0.0}</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.openstack.org/nova/latest/configuration/config.html?highlight=host_manager#scheduler">https://docs.openstack.org/nova/latest/configuration/config.html?highlight=host_manager#scheduler</a><br />
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.openstack.org/nova/latest/configuration/config.html?highlight=driver#scheduler">https://docs.openstack.org/nova/latest/configuration/config.html?highlight=driver#scheduler</a><br />
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.openstack.org/nova/latest/user/filter-scheduler.html">https://docs.openstack.org/nova/latest/user/filter-scheduler.html</a><br />
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://developer.openstack.org/api-ref/compute/#create-server">https://developer.openstack.org/api-ref/compute/#create-server</a><br />
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2018-04-26</p>
<p class="author">Author: Andrey Volkov</p>
<p class="date">Created: 2018-04-26 Thu 17:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
